Autodesk.Revit.DB.BuiltInFailures.ArrayFailures.OnlyGroupsAndInstancesShouldBePlaced
Only Groups and certain Instances should be placed with Arrays. The Arrays will not place anything.

Autodesk.Revit.DB.BuiltInFailures.ArrayFailures.InvalidPath3dIsAssignedToArray
Invalid Path3d is assigned to the Array.